Revit 2027 API
BuiltInFailures.LevelFailures.NoLevelsLeft Property
 There are no levels or plan views remaining in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoLevelsLeft { get; }
Public Shared ReadOnly Property NoLevelsLeft As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoLevelsLeft {
	FailureDefinitionId^ get ();
}
static member NoLevelsLeft : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LevelFailures Class
Autodesk.Revit.DB Namespace